Lora-net/LoRaMac-node/src/boards/mcu/MSP430FR5xx_6xx/cs.c
    //Keep overshoot transient within specification by setting clk
    //sources to divide by 4
    //Clear the DIVS & DIVM masks (~0x77) and set both fields to 4 divider
    HWREG16(CS_BASE + OFS_CSCTL3) = HWREG16(CS_BASE + OFS_CSCTL3) &
                                    (~(0x77)) | DIVS1 | DIVM1;

    //Set user's frequency selection for DCO
    HWREG16(CS_BASE + OFS_CSCTL1) = (dcorsel + dcofsel);

    //Delay by ~10us to let DCO settle. cycles to wait = 20 cycles buffer +
    //(10us * (x MHz/4))
    switch(dcofsel)
    {
    case (CS_DCOFSEL_0):
        //1 MHz or 1 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(23) : __delay_cycles(23);
        break;
    case (CS_DCOFSEL_1):
        //2.67 MHz or 5.33 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(27) : __delay_cycles(34);
        break;
    case (CS_DCOFSEL_2):
        //3.33 MHz or 6.67 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(29) : __delay_cycles(37);
        break;
    case (CS_DCOFSEL_3):
        //4 MHz or 8 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(30) : __delay_cycles(40);
        break;
    case (CS_DCOFSEL_4):
        //5.33 MHz or 16 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(34) : __delay_cycles(60);
        break;
    case (CS_DCOFSEL_5):
        //6.67 MHz or 21 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(37) : __delay_cycles(73);
        break;
    case (CS_DCOFSEL_6):
        //8 MHz or 24 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
        break;
    default:
        //Should not be used, but default is 8 MHz or 24 MHz
        (dcorsel == CS_DCORSEL_0) ? __delay_cycles(40) : __delay_cycles(80);
        break;
    }

    //Set all dividers
    HWREG16(CS_BASE + OFS_CSCTL3) = tempCSCTL3;

    //Lock CS control register
    HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
